# Libs

In [2]:
import pandas as pd
import streamlit as st

# Leitura da base crua

In [3]:
# Carregar arquivo Excel
# arquivo = "./Fatura-Excel.xls"  # Substitua pelo nome do seu arquivo
arquivo = r"C:\Users\feh_s\Streamlit-for-Data-Science\ControleFinanceiro\Faturas\Fatura-Excel-Fevereiro.xls"  # Substitua pelo nome do seu arquivo

df = pd.read_excel(arquivo)
df.head()

  Logotipo Itaú               Unnamed: 1 Unnamed: 2 Unnamed: 3
0  Atualização:   26/02/2025 às 11:27:00        NaN        NaN
1         Nome:  FELIPE BATISTA DE SOUZA        NaN        NaN
2      Agência:                     6369        NaN        NaN
3        Conta:                  28614-8        NaN        NaN
4           NaN                      NaN        NaN        NaN

# Limpeza dos dados

## Drop colunas

In [4]:
df.drop(columns='Unnamed: 2', inplace=True)
df.head()

  Logotipo Itaú               Unnamed: 1 Unnamed: 3
0  Atualização:   26/02/2025 às 11:27:00        NaN
1         Nome:  FELIPE BATISTA DE SOUZA        NaN
2      Agência:                     6369        NaN
3        Conta:                  28614-8        NaN
4           NaN                      NaN        NaN

## Renomeia colunas

In [5]:
NomesColunas = {
    0:'Data'
    , 1: 'NmGasto'
    , 2: 'Valor'
}

df.columns = [NomesColunas[i] if i in NomesColunas else df.columns[i] for i in range(len(df.columns))]
df.head()

           Data                  NmGasto Valor
0  Atualização:   26/02/2025 às 11:27:00   NaN
1         Nome:  FELIPE BATISTA DE SOUZA   NaN
2      Agência:                     6369   NaN
3        Conta:                  28614-8   NaN
4           NaN                      NaN   NaN

## Retirando NaN

In [6]:
df_SemNulo = df[(~df['Valor'].isnull()) & (~df['Data'].isnull())].reset_index(drop=True)

In [7]:
df_SemNulo[df_SemNulo['Valor'].isnull()]

Empty DataFrame
Columns: [Data, NmGasto, Valor]
Index: []

## Selecionando os valores verdadeiros

## Limpa data

In [13]:
# Expressão regular para encontrar datas no formato dd/mm/yyyy
padrao_data = r"^\d{2}/\d{2}/\d{4}$"

# Filtrar linhas com datas no formato certo
filtro = df_SemNulo["Data"].astype(str).str.match(padrao_data)
df_Union = df_SemNulo[filtro].reset_index(drop=True)

df_Union.head()

         Data                  NmGasto  Valor
0  10/02/2025                 Dm*udemy   24.9
1  01/02/2025               Google One   79.9
2  02/02/2025     Google Myworkoutplan  16.99
3  16/02/2025    Google 365scores Live   7.97
4  13/01/2025  Amazon Marketplace02/03  86.98

In [ ]:
# valorAlvo = 'data'
# colunaAlvo = "Data"
# indice1 = df_SemNulo[df_SemNulo["Data"] == valorAlvo].index[0]
# indice2 = df_SemNulo[df_SemNulo["Data"] == valorAlvo].index[1]


# # Filtrar o DataFrame a partir dessa linha
# df_data1 = df_SemNulo.iloc[indice1+1:indice2-1]
# df_data2 = df_SemNulo.iloc[indice2+1:]

# # Une os 2 dataframes
# df_Union = pd.concat([df_data1, df_data2], ignore_index=True)
# df_Union.head()

,Data,NmGasto,Valor
0,10/02/2025,Dm*udemy,24.9
1,01/02/2025,Google One,79.9
2,02/02/2025,Google Myworkoutplan,16.99
3,16/02/2025,Google 365scores Live,7.97
4,total nacional do cartão - final 0887 (adicional),NaN,104.86

## Retira total

In [ ]:
# NovoIndice = df_Union[df_Union[colunaAlvo].str.startswith('total nacional do cartão')].index[0]
# NovoIndice

IndexError: index 0 is out of bounds for axis 0 with size 0

In [ ]:
# df_STotal = df_Union.iloc[:NovoIndice]

In [15]:
df_Union['Valor'].sum()

3282.89

# Check base

In [12]:
df_STotal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Data     4 non-null      object
 1   NmGasto  4 non-null      object
 2   Valor    4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [19]:
df_STotal.describe()

              Data             NmGasto  Valor
count           33                  33   33.0
unique          22                  28   32.0
top     06/05/2025  99app       *99app   26.4
freq             4                   5    2.0

In [23]:
df_STotal.Valor.sum()

3122.34